CodeIgniter/app/Controllers/AssignStudent.php

    public function index() {
        $classModel = new \App\Models\ClassModel();
        $data['result'] = $classModel->findAll();
---
SELECT *
FROM `Class`