CodeIgniter/app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Cory Marleau', 'marleau24@up.edu', 'Test1')
---
    public function save() {

        $validation = $this->validate([
            'name'=>'required',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[5]|max_length[12]',
            'cpassword' => 'required|min_length[5]|max_length[12]|matches[password]'
        ]);

        if (!$validation) {
            return view('auth/register', ['validation'=>$this->validator]);
        } else {

            $name = $this->request->getPost('name');
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $values = [
                'name' =>$name,
                'email'=>$email,
                'password'=>Hash::make($password),
            ];

            $usersModel = new \App\Models\UsersModel();
            $query = $usersModel->insert($values);