CodeIgniter/app/Controllers/Dashboard.php

    public function index()
    {
        $usersModel = new \App\Models\UsersModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'