CodeIgniter/app/Controllers/GradeController.php

    public function index($classId) {
        $scheduleModel = new \App\Models\ScheduleModel();
        $classModel = new \App\Models\ClassModel();
        $studentModel = new \App\Models\StudentModel();
        $scheduleInfo = $scheduleModel->where('ClassID', $classId)->findAll();
        $classInfo = $classModel->where('ClassID', $classId)->findAll();
---
SELECT *
FROM `Schedule`
WHERE `ClassID` = '106'
SELECT *
FROM `Class`
WHERE `ClassID` = '106'

    public function edit($classId) {
        $scheduleModel = new \App\Models\ScheduleModel();
        $classModel = new \App\Models\ClassModel();
        $studentModel = new \App\Models\StudentModel();
        $scheduleInfo = $scheduleModel->where('ClassID', $classId)->findAll();
        $classInfo = $classModel->where('ClassID', $classId)->findAll();
        $length = sizeof($scheduleInfo);
        for($i = 0; $i < $length; $i++){
            $studentId = $scheduleInfo[$i]['StudentID'];
            $studentInfo = $studentModel->where('StudentID', $studentId)->findAll();
---
SELECT *
FROM `Schedule`
WHERE `ClassID` = '105'
SELECT *
FROM `Class`
WHERE `ClassID` = '105'
SELECT *
FROM `Student`
WHERE `StudentID` = '1234'