CodeIgniter/app/Controllers/SearchController.php

SELECT *
FROM `Class`
---
    public function index()
    {
        $classModel = new \App\Models\ClassModel();

        $data['result'] = $classModel->findAll();

SELECT *
FROM `Class`
WHERE `ClassName` LIKE '%BIOLOGY%' ESCAPE '!'
---
    public function search()
    {
        $classModel = new \App\Models\ClassModel();
        $classQuery = $this->request->getPost('query');
        $classInfo = $classModel->like('ClassName', $classQuery)->findAll();