CodeIgniter/app/Controllers/Transcript.php

    public function selectStudent()
    {
        $studentModel = new \App\Models\StudentModel();
        $students = $studentModel->findAll();
---
SELECT *
FROM `Student`
WHERE `Student`.`StudentID` = 1234

    public function showTranscript()
{
    $studentModel = new \App\Models\StudentModel();
    $scheduleModel = new \App\Models\ScheduleModel();
    $classModel = new \App\Models\ClassModel();

    $studentId = $this->request->getPost('student_id'); // Get student ID from form submission
    $student = $studentModel->find($studentId);
    $studentName = "{$student['FirstName']} {$student['LastName']}";

    // Fetch the classes the student is enrolled in
    $enrolledClassIds = $scheduleModel->where('StudentID', $studentId)->findColumn('ClassID');
    $enrolledClasses = $scheduleModel->select('Schedule.Grade, Class.ClassName')
                             ->join('Class', 'Class.ClassID = Schedule.ClassID')
                             ->whereIn('Schedule.ClassID', $enrolledClassIds)
                             ->where('Schedule.StudentID', $studentId)
                             ->findAll();
---
SELECT *
FROM `Student`
WHERE `Student`.`StudentID` = '1234'
SELECT `ClassID`
FROM `Schedule`
WHERE `StudentID` = '1234'
SELECT `Schedule`.`Grade`, `Class`.`ClassName`
FROM `Schedule`
JOIN `Class` ON `Class`.`ClassID` = `Schedule`.`ClassID`
WHERE `Schedule`.`ClassID` IN ('108','101','103','105')
AND `Schedule`.`StudentID` = '1234'