CodeIgniter/app/Controllers/Transcript.php

SELECT `ClassID`
FROM `Schedule`
WHERE `StudentID` = 1234
---
    public function result()
    {
        $studentModel = new \App\Models\StudentModel();
        $scheduleModel = new \App\Models\ScheduleModel();
        $classModel = new \App\Models\ClassModel();

        $studentId = 1234;
        $student = $studentModel->find($studentId);
        $studentName = "{$student['FirstName']} {$student['LastName']}";

        // Fetch the classes the student is enrolled in
        $enrolledClassIds = $scheduleModel->where('StudentID', $studentId)->findColumn('ClassID');